Can't create Group because it contains multiple copies of same Group.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId GroupsHasCycle { get; }
  Visual Basic
Public Shared ReadOnly Property GroupsHasCycle As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ GroupsHasCycle {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GroupFailures Class
  Autodesk.Revit.DB Namespace